### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [4]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
school_data_to_load = "Resources/schools_complete.csv"
student_data_to_load = "Resources/students_complete.csv"

# Read School and Student Data File and store into Pandas DataFrames
school_data = pd.read_csv(school_data_to_load)
student_data = pd.read_csv(student_data_to_load)

# Combine the data into a single dataset.  
school_data_complete = pd.merge(student_data, school_data, how="left", on=["school_name", "school_name"])
school_data_complete.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

## District Summary

* Calculate the total number of schools

* Calculate the total number of students

* Calculate the total budget

* Calculate the average math score 

* Calculate the average reading score

* Calculate the percentage of students with a passing math score (70 or greater)

* Calculate the percentage of students with a passing reading score (70 or greater)

* Calculate the percentage of students who passed math **and** reading (% Overall Passing)

* Create a dataframe to hold the above results

* Optional: give the displayed data cleaner formatting

In [6]:
#look for missing values, per results no need to dropna
school_data_complete.count()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
School ID        39170
type             39170
size             39170
budget           39170
dtype: int64

In [7]:
#identify data types
school_data_complete.dtypes

Student ID        int64
student_name     object
gender           object
grade            object
school_name      object
reading_score     int64
math_score        int64
School ID         int64
type             object
size              int64
budget            int64
dtype: object

In [8]:
total_schools=school_data_complete["school_name"].nunique()
total_students=school_data_complete["student_name"].count()
math_avg=school_data_complete["math_score"].mean()
read_avg=school_data_complete["reading_score"].mean()

In [9]:
uniqueValues = school_data_complete['budget'].unique()
print('Unique values in column "budget" ')
print(uniqueValues)

total_budget=uniqueValues.sum()

Unique values in column "budget"
[1910635 1884411 1056600 3022020  917500 1319574 1081356 3124928  248087
  585858 1049400 2547363 3094650 1763916 1043130]

In [10]:
math_pass=school_data_complete[(school_data_complete["math_score"]>=70)].count()["student_name"]
math_pass_pct=(math_pass/total_students)*100
math_pass_pct

74.9808526933878

In [11]:
read_pass=school_data_complete[(school_data_complete["reading_score"]>=70)].count()["student_name"]
read_pass_pct=(read_pass/total_students)*100
read_pass_pct

85.80546336482001

In [12]:
overall_pass=school_data_complete[(school_data_complete["reading_score"]>=70) & (school_data_complete["math_score"]>=70)].count()["student_name"]
overall_pass_pct=(overall_pass/total_students)*100
overall_pass_pct

65.17232575950983

In [13]:
summary_df = pd.DataFrame({
    "Total Schools": [total_schools],
    "Total Students": [total_students],
    "Total Budget": [total_budget],
    "Average Math Score": [math_avg],
    "Average Reading Score": [read_avg],
    "% Passing Math": [math_pass_pct],
    "% Passing Reading": [read_pass_pct],
    "% Overall Passing": [overall_pass_pct]
    
    
})
summary_df.head()

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,39170,24649428,78.985371,81.87784,74.980853,85.805463,65.172326

## School Summary

* Create an overview table that summarizes key metrics about each school, including:
  * School Name
  * School Type
  * Total Students
  * Total School Budget
  * Per Student Budget
  * Average Math Score
  * Average Reading Score
  * % Passing Math
  * % Passing Reading
  * % Overall Passing (The percentage of students that passed math **and** reading.)
  
* Create a dataframe to hold the above results

In [5]:
#hs_grp = school_data_complete.groupby(['school_name', 'type'])
#hs_grp_avg = hs_grp["reading_score", "math_score"].mean()

In [14]:
# Using GroupBy in order to separate the data into fields according to "school" values
grouped_school_df = school_data_complete.groupby(['school_name'])

# The object returned is a "GroupBy" object and cannot be viewed normally...
print(grouped_school_df)

# In order to be visualized, a data function must be used...
grouped_school_df.count().head(10)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x00000225BBA1F310>

,Student ID,student_name,gender,grade,reading_score,math_score,School ID,type,size,budget
school_name,,,,,,,,,,
Bailey High School,4976,4976,4976,4976,4976,4976,4976,4976,4976,4976
Cabrera High School,1858,1858,1858,1858,1858,1858,1858,1858,1858,1858
Figueroa High School,2949,2949,2949,2949,2949,2949,2949,2949,2949,2949
Ford High School,2739,2739,2739,2739,2739,2739,2739,2739,2739,2739
Griffin High School,1468,1468,1468,1468,1468,1468,1468,1468,1468,1468
Hernandez High School,4635,4635,4635,4635,4635,4635,4635,4635,4635,4635
Holden High School,427,427,427,427,427,427,427,427,427,427
Huang High School,2917,2917,2917,2917,2917,2917,2917,2917,2917,2917
Johnson High School,4761,4761,4761,4761,4761,4761,4761,4761,4761,4761
Pena High School,962,962,962,962,962,962,962,962,962,962

In [15]:
grouped_school_df["Student ID"].count()

school_name
Bailey High School       4976
Cabrera High School      1858
Figueroa High School     2949
Ford High School         2739
Griffin High School      1468
Hernandez High School    4635
Holden High School        427
Huang High School        2917
Johnson High School      4761
Pena High School          962
Rodriguez High School    3999
Shelton High School      1761
Thomas High School       1635
Wilson High School       2283
Wright High School       1800
Name: Student ID, dtype: int64

In [16]:
total_student = grouped_school_df["Student ID"].count()
total_student.head()

school_name
Bailey High School      4976
Cabrera High School     1858
Figueroa High School    2949
Ford High School        2739
Griffin High School     1468
Name: Student ID, dtype: int64

In [17]:
grouped_school_df["budget"].unique()

school_name
Bailey High School       [3124928]
Cabrera High School      [1081356]
Figueroa High School     [1884411]
Ford High School         [1763916]
Griffin High School       [917500]
Hernandez High School    [3022020]
Holden High School        [248087]
Huang High School        [1910635]
Johnson High School      [3094650]
Pena High School          [585858]
Rodriguez High School    [2547363]
Shelton High School      [1056600]
Thomas High School       [1043130]
Wilson High School       [1319574]
Wright High School       [1049400]
Name: budget, dtype: object

In [216]:
total_budget = grouped_school_df["budget"].unique()
total_budget_no=total_budget.astype(float)
total_budget_no.head()

school_name
Bailey High School      3124928.0
Cabrera High School     1081356.0
Figueroa High School    1884411.0
Ford High School        1763916.0
Griffin High School      917500.0
Name: budget, dtype: float64

In [217]:
total_budget_no/total_student

school_name
Bailey High School       628.0
Cabrera High School      582.0
Figueroa High School     639.0
Ford High School         644.0
Griffin High School      625.0
Hernandez High School    652.0
Holden High School       581.0
Huang High School        655.0
Johnson High School      650.0
Pena High School         609.0
Rodriguez High School    637.0
Shelton High School      600.0
Thomas High School       638.0
Wilson High School       578.0
Wright High School       583.0
dtype: float64

In [218]:
student_budget=total_budget_no/total_student
student_budget.head()

school_name
Bailey High School      628.0
Cabrera High School     582.0
Figueroa High School    639.0
Ford High School        644.0
Griffin High School     625.0
dtype: float64

In [220]:
grouped_school_df["math_score"].mean()

school_name
Bailey High School       77.048432
Cabrera High School      83.061895
Figueroa High School     76.711767
Ford High School         77.102592
Griffin High School      83.351499
Hernandez High School    77.289752
Holden High School       83.803279
Huang High School        76.629414
Johnson High School      77.072464
Pena High School         83.839917
Rodriguez High School    76.842711
Shelton High School      83.359455
Thomas High School       83.418349
Wilson High School       83.274201
Wright High School       83.682222
Name: math_score, dtype: float64

In [22]:
avg_math_score=grouped_school_df["math_score"].mean()
avg_math_score.head()

school_name
Bailey High School      77.048432
Cabrera High School     83.061895
Figueroa High School    76.711767
Ford High School        77.102592
Griffin High School     83.351499
Name: math_score, dtype: float64

In [23]:
grouped_school_df["reading_score"].mean()

school_name
Bailey High School       81.033963
Cabrera High School      83.975780
Figueroa High School     81.158020
Ford High School         80.746258
Griffin High School      83.816757
Hernandez High School    80.934412
Holden High School       83.814988
Huang High School        81.182722
Johnson High School      80.966394
Pena High School         84.044699
Rodriguez High School    80.744686
Shelton High School      83.725724
Thomas High School       83.848930
Wilson High School       83.989488
Wright High School       83.955000
Name: reading_score, dtype: float64

In [24]:
avg_reading_score=grouped_school_df["reading_score"].mean()
avg_reading_score.head()

school_name
Bailey High School      81.033963
Cabrera High School     83.975780
Figueroa High School    81.158020
Ford High School        80.746258
Griffin High School     83.816757
Name: reading_score, dtype: float64

In [25]:
pass_math=school_data_complete[school_data_complete["math_score"]>=70]

In [26]:
pass_math_count=pass_math.groupby(["school_name"]).count()["math_score"]

In [27]:
pass_math_pct=(pass_math_count/total_student)*100
pass_math_pct.head()

school_name
Bailey High School      66.680064
Cabrera High School     94.133477
Figueroa High School    65.988471
Ford High School        68.309602
Griffin High School     93.392371
dtype: float64

In [28]:
pass_reading=school_data_complete[school_data_complete["reading_score"]>=70]

In [29]:
pass_reading_count=pass_reading.groupby(["school_name"]).count()["reading_score"]

In [30]:
pass_reading_pct=(pass_reading_count/total_student)*100
pass_reading_pct.head()

school_name
Bailey High School      81.933280
Cabrera High School     97.039828
Figueroa High School    80.739234
Ford High School        79.299014
Griffin High School     97.138965
dtype: float64

In [56]:
pass_overall=school_data_complete[(school_data_complete["math_score"]>=70) & (school_data_complete["reading_score"]>=70)]

In [57]:
pass_overall_count=pass_overall.groupby(["school_name"]).count()["Student ID"]

In [58]:
pass_overall_count.head()

school_name
Bailey High School      2719
Cabrera High School     1697
Figueroa High School    1569
Ford High School        1487
Griffin High School     1330
Name: Student ID, dtype: int64

In [59]:
pass_overall_pct=(pass_overall_count/total_student)*100

In [60]:
pass_overall_pct.head()

school_name
Bailey High School      54.642283
Cabrera High School     91.334769
Figueroa High School    53.204476
Ford High School        54.289887
Griffin High School     90.599455
Name: Student ID, dtype: float64

In [225]:
grouped_school_df["type"].unique()

school_name
Bailey High School       [District]
Cabrera High School       [Charter]
Figueroa High School     [District]
Ford High School         [District]
Griffin High School       [Charter]
Hernandez High School    [District]
Holden High School        [Charter]
Huang High School        [District]
Johnson High School      [District]
Pena High School          [Charter]
Rodriguez High School    [District]
Shelton High School       [Charter]
Thomas High School        [Charter]
Wilson High School        [Charter]
Wright High School        [Charter]
Name: type, dtype: object

In [227]:
type=grouped_school_df["type"].unique()
type.head()

school_name
Bailey High School      [District]
Cabrera High School      [Charter]
Figueroa High School    [District]
Ford High School        [District]
Griffin High School      [Charter]
Name: type, dtype: object

In [228]:
school_summary_df = pd.DataFrame({
    "School Type": type,
    "Total Students": total_student,
    "Total School Budget": total_budget_no,
    "Per Student Budget": student_budget,
    "Average Math Score": avg_math_score,
    "Average Reading Score": avg_reading_score,
    "% Passing Math": pass_math_pct,
    "% Passing Reading": pass_reading_pct,
    "% Overall Passing": pass_overall_pct,
    
})
school_summary_df.head()

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
school_name,,,,,,,,,
Bailey High School,[District],4976,3124928.0,628.0,77.048432,81.033963,66.680064,81.933280,54.642283
Cabrera High School,[Charter],1858,1081356.0,582.0,83.061895,83.975780,94.133477,97.039828,91.334769
Figueroa High School,[District],2949,1884411.0,639.0,76.711767,81.158020,65.988471,80.739234,53.204476
Ford High School,[District],2739,1763916.0,644.0,77.102592,80.746258,68.309602,79.299014,54.289887
Griffin High School,[Charter],1468,917500.0,625.0,83.351499,83.816757,93.392371,97.138965,90.599455

## Top Performing Schools (By % Overall Passing)

In [62]:
sort_school_summary_df=school_summary_df.sort_values("% Overall Passing", ascending=False)
sort_school_summary_df.head()

,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
school_name,,,,,,,,
Cabrera High School,1858,[1081356],[582.0],83.061895,83.975780,94.133477,97.039828,91.334769
Thomas High School,1635,[1043130],[638.0],83.418349,83.848930,93.272171,97.308869,90.948012
Griffin High School,1468,[917500],[625.0],83.351499,83.816757,93.392371,97.138965,90.599455
Wilson High School,2283,[1319574],[578.0],83.274201,83.989488,93.867718,96.539641,90.582567
Pena High School,962,[585858],[609.0],83.839917,84.044699,94.594595,95.945946,90.540541

* Sort and display the top five performing schools by % overall passing.

## Bottom Performing Schools (By % Overall Passing)

* Sort and display the five worst-performing schools by % overall passing.

In [64]:
sort_school_summary_df=school_summary_df.sort_values("% Overall Passing")
sort_school_summary_df.head()

,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
school_name,,,,,,,,
Rodriguez High School,3999,[2547363],[637.0],76.842711,80.744686,66.366592,80.220055,52.988247
Figueroa High School,2949,[1884411],[639.0],76.711767,81.158020,65.988471,80.739234,53.204476
Huang High School,2917,[1910635],[655.0],76.629414,81.182722,65.683922,81.316421,53.513884
Hernandez High School,4635,[3022020],[652.0],77.289752,80.934412,66.752967,80.862999,53.527508
Johnson High School,4761,[3094650],[650.0],77.072464,80.966394,66.057551,81.222432,53.539172

In [141]:
sort_school_summary_df.dtypes

Total Students             int64
Total School Budget       object
Per Student Budget        object
Average Math Score       float64
Average Reading Score    float64
% Passing Math           float64
% Passing Reading        float64
% Overall Passing        float64
dtype: object

## Math Scores by Grade

* Create a table that lists the average Reading Score for students of each grade level (9th, 10th, 11th, 12th) at each school.

  * Create a pandas series for each grade. Hint: use a conditional statement.
  
  * Group each series by school
  
  * Combine the series into a dataframe
  
  * Optional: give the displayed data cleaner formatting

In [282]:
# Using GroupBy in order to separate the data into fields according to "school" values
#math_df = school_data_complete.set_index('school_name')
reduce_math_df=school_data_complete[["school_name","grade","math_score"]].set_index("school_name")
reduce_math_df.head(10)

                  grade  math_score
school_name
Huang High School   9th          79
Huang High School  12th          61
Huang High School  12th          60
Huang High School  12th          58
Huang High School   9th          84
Huang High School   9th          94
Huang High School  11th          80
Huang High School  12th          69
Huang High School  10th          87
Huang High School  10th          84

In [283]:
grade09 = reduce_math_df.loc[: , 'grade'] == '9th'
grade09.head()

school_name
Huang High School     True
Huang High School    False
Huang High School    False
Huang High School    False
Huang High School     True
Name: grade, dtype: bool

In [284]:
grade09_series=reduce_math_df.loc[grade09, "math_score"]
grade09_series.head()

school_name
Huang High School    79
Huang High School    84
Huang High School    94
Huang High School    79
Huang High School    79
Name: math_score, dtype: int64

In [285]:
grade09_avg=grade09_series.groupby('school_name').mean()
grade09_avg.head()

school_name
Bailey High School      77.083676
Cabrera High School     83.094697
Figueroa High School    76.403037
Ford High School        77.361345
Griffin High School     82.044010
Name: math_score, dtype: float64

grade09_avg_school=grad09_avg.groupby["school_name]

In [286]:
grade10 = reduce_math_df.loc[: , 'grade'] == '10th'
grade10_series=reduce_math_df.loc[grade10, "math_score"]
grade10_avg=grade10_series.groupby('school_name').mean()
grade10_avg.head()

school_name
Bailey High School      76.996772
Cabrera High School     83.154506
Figueroa High School    76.539974
Ford High School        77.672316
Griffin High School     84.229064
Name: math_score, dtype: float64

In [287]:
grade11 = reduce_math_df.loc[: , 'grade'] == '11th'
grade11_series=reduce_math_df.loc[grade11, "math_score"]
grade11_avg=grade11_series.groupby('school_name').mean()
grade11_avg.head()

school_name
Bailey High School      77.515588
Cabrera High School     82.765560
Figueroa High School    76.884344
Ford High School        76.918058
Griffin High School     83.842105
Name: math_score, dtype: float64

In [288]:
grade12 = reduce_math_df.loc[: , 'grade'] == '12th'
grade12_series=reduce_math_df.loc[grade12, "math_score"]
grade12_avg=grade12_series.groupby('school_name').mean()
grade12_avg.head()

school_name
Bailey High School      76.492218
Cabrera High School     83.277487
Figueroa High School    77.151369
Ford High School        76.179963
Griffin High School     83.356164
Name: math_score, dtype: float64

In [289]:
math_grade_summary_df = pd.DataFrame({
    "9th": grade09_avg,
    "10th": grade10_avg,
    "11th": grade11_avg,  
    "12th": grade12_avg, 
})
math_grade_summary_df.head()

                            9th       10th       11th       12th
school_name
Bailey High School    77.083676  76.996772  77.515588  76.492218
Cabrera High School   83.094697  83.154506  82.765560  83.277487
Figueroa High School  76.403037  76.539974  76.884344  77.151369
Ford High School      77.361345  77.672316  76.918058  76.179963
Griffin High School   82.044010  84.229064  83.842105  83.356164

## Reading Score by Grade

* Perform the same operations as above for reading scores

In [290]:
reduce_read_df=school_data_complete[["school_name","grade","reading_score"]].set_index("school_name")
reduce_read_df.head(10)

                  grade  reading_score
school_name
Huang High School   9th             66
Huang High School  12th             94
Huang High School  12th             90
Huang High School  12th             67
Huang High School   9th             97
Huang High School   9th             94
Huang High School  11th             82
Huang High School  12th             96
Huang High School  10th             95
Huang High School  10th             96

In [291]:

read09 = reduce_read_df.loc[: , 'grade'] == '9th'
read09_series=reduce_read_df.loc[read09, "reading_score"]
read09_avg=read09_series.groupby('school_name').mean()
read09_avg.head()

read10 = reduce_read_df.loc[: , 'grade'] == '10th'
read10_series=reduce_read_df.loc[read10, "reading_score"]
read10_avg=read10_series.groupby('school_name').mean()

read11 = reduce_read_df.loc[: , 'grade'] == '11th'
read11_series=reduce_read_df.loc[read11, "reading_score"]
read11_avg=read11_series.groupby('school_name').mean()

read12 = reduce_read_df.loc[: , 'grade'] == '12th'
read12_series=reduce_read_df.loc[read12, "reading_score"]
read12_avg=read12_series.groupby('school_name').mean()

In [292]:
reading_grade_summary_df = pd.DataFrame({
    "9th": read09_avg,
    "10th": read10_avg,
    "11th": read11_avg,  
    "12th": read12_avg, 
})
reading_grade_summary_df.head()

                            9th       10th       11th       12th
school_name
Bailey High School    81.303155  80.907183  80.945643  80.912451
Cabrera High School   83.676136  84.253219  83.788382  84.287958
Figueroa High School  81.198598  81.408912  80.640339  81.384863
Ford High School      80.632653  81.262712  80.403642  80.662338
Griffin High School   83.369193  83.706897  84.288089  84.013699

## Scores by School Spending

* Create a table that breaks down school performances based on average Spending Ranges (Per Student). Use 4 reasonable bins to group school spending. Include in the table each of the following:
  * Average Math Score
  * Average Reading Score
  * % Passing Math
  * % Passing Reading
  * Overall Passing Rate (Average of the above two)

In [173]:
bins=[0, 585, 630, 645, 680]
bin_name=["<$585", "$585-$630", "$630-$645", "$645-$680"]
school_summary_df.head()
school_summary_df.dtypes

Total Students             int64
Total School Budget      float64
Per Student Budget       float64
Average Math Score       float64
Average Reading Score    float64
% Passing Math           float64
% Passing Reading        float64
% Overall Passing        float64
dtype: object

In [178]:
school_summary_df["Budget Bin"]=pd.cut(school_summary_df["Per Student Budget"], bins, labels=bin_name)
school_summary_df.head()

,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing,Budget Bin
school_name,,,,,,,,,
Bailey High School,4976,3124928.0,628.0,77.048432,81.033963,66.680064,81.933280,54.642283,$585-$630
Cabrera High School,1858,1081356.0,582.0,83.061895,83.975780,94.133477,97.039828,91.334769,<$585
Figueroa High School,2949,1884411.0,639.0,76.711767,81.158020,65.988471,80.739234,53.204476,$630-$645
Ford High School,2739,1763916.0,644.0,77.102592,80.746258,68.309602,79.299014,54.289887,$630-$645
Griffin High School,1468,917500.0,625.0,83.351499,83.816757,93.392371,97.138965,90.599455,$585-$630

In [181]:
by_bin=school_summary_df.groupby("Budget Bin")["Average Math Score", "Average Reading Score", "% Passing Math", "% Passing Reading", "% Overall Passing"].mean()
by_bin

<ipython-input-181-cf3e7c5bb13b>:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  by_bin=school_summary_df.groupby("Budget Bin")["Average Math Score", "Average Reading Score", "% Passing Math", "% Passing Reading", "% Overall Passing"].mean()

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
Budget Bin,,,,,
<$585,83.455399,83.933814,93.460096,96.610877,90.369459
$585-$630,81.899826,83.155286,87.133538,92.718205,81.418596
$630-$645,78.518855,81.624473,73.484209,84.391793,62.857656
$645-$680,76.997210,81.027843,66.164813,81.133951,53.526855

## Scores by School Size

* Perform the same operations as above, based on school size.

In [187]:
school_bins=[0, 1000, 2000, 5000]
bin_size=["Small<1000", "Medium(1000-2000)", "Large(2000-5000)"]

In [188]:
school_summary_df["School Size"]=pd.cut(school_summary_df["Total Students"], bins, labels=bin_name)
school_summary_df.head()

,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing,Budget Bin,School Size
school_name,,,,,,,,,,
Bailey High School,4976,3124928.0,628.0,77.048432,81.033963,66.680064,81.933280,54.642283,$585-$630,Large(2000-5000)
Cabrera High School,1858,1081356.0,582.0,83.061895,83.975780,94.133477,97.039828,91.334769,<$585,Medium(1000-2000)
Figueroa High School,2949,1884411.0,639.0,76.711767,81.158020,65.988471,80.739234,53.204476,$630-$645,Large(2000-5000)
Ford High School,2739,1763916.0,644.0,77.102592,80.746258,68.309602,79.299014,54.289887,$630-$645,Large(2000-5000)
Griffin High School,1468,917500.0,625.0,83.351499,83.816757,93.392371,97.138965,90.599455,$585-$630,Medium(1000-2000)

In [189]:
by_bin=school_summary_df.groupby("School Size")["Average Math Score", "Average Reading Score", "% Passing Math", "% Passing Reading", "% Overall Passing"].mean()
by_bin

<ipython-input-189-6be8e5584bfa>:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  by_bin=school_summary_df.groupby("School Size")["Average Math Score", "Average Reading Score", "% Passing Math", "% Passing Reading", "% Overall Passing"].mean()

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
School Size,,,,,
Small<1000,83.821598,83.929843,93.550225,96.099437,89.883853
Medium(1000-2000),83.374684,83.864438,93.599695,96.790680,90.621535
Large(2000-5000),77.746417,81.344493,69.963361,82.766634,58.286003

## Scores by School Type

* Perform the same operations as above, based on school type

In [190]:
#type_bins=[0, 2, 3]
#bin_type_name=["Charter", "District",]

In [212]:
School_Type=school_summary_df.groupby("Student Type")["Average Math Score", "Average Reading Score", "% Passing Math", "% Passing Reading", "% Overall Passing"].mean()
School_Type

KeyError: 'Student Type'

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
School Type,,,,,
Charter,83.473852,83.896421,93.620830,96.586489,90.432244
District,76.956733,80.966636,66.548453,80.799062,53.672208